*Pandas*
1.String IO
2.Pandas read_csv

In [9]:
from io import StringIO

In [7]:
import pandas as pd

In [9]:
df=pd.read_csv('data.csv')

In [10]:
df

         Name  Roll  Age
0       S.Dey    24   19
1  M.Banerjee     7   20
2      S.Pati    44   20
3       M.Dey    23   20
4     P.Lorem    45   67

In [ ]:
df.head()

In [ ]:
df

In [ ]:
df

In [15]:
df=pd.read_csv('data.csv')
df

         Name  Roll  Age
0       S.Dey    24   19
1  M.Banerjee     7   20
2      S.Pati    44   20
3       M.Dey    23   20
4     P.Lorem    45   67

In [ ]:
data=('Col1,Col2,Col3\n'
      'x,y,z\n'
      'a,b,c')

In [12]:
df=pd.read_csv(StringIO(data))

In [13]:
df

  Col1 Col2 Col3
0    x    y    z
1    a    b    c

In [19]:
df=pd.read_csv(StringIO(data),usecols=['Col1','Col2'])

In [20]:
df

  Col1 Col2
0    x    y
1    a    b

In [22]:
df.to_csv('text.csv',index=False)

In [5]:
data=('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11,12')

In [11]:
df=pd.read_csv(StringIO(data))
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 228.0 bytes

In [ ]:
df=pd.read_csv(StringIO(data),dtype=object)